---
kind: type
id: T:Autodesk.Revit.DB.LinkOriginFileType
source: html/fa040617-6c74-b50b-765b-a0eedf6f1073.htm
---
# Autodesk.Revit.DB.LinkOriginFileType

Enum determining whether the source type of a temporary rvt link is an ifc.

## Syntax (C#)
```csharp
public enum LinkOriginFileType
```